# Taps
tap "ddev/ddev"

# Core tools
brew "fnm"
brew "fzf"
brew "gh"
brew "tree"
brew "wget"

# Languages & version managers
brew "uv"
brew "rbenv"
brew "ruby-build"

# Media tools
brew "ffmpeg"

# Web dev
brew "ddev/ddev/ddev"
brew "mkcert"
brew "nss"

# Utilities
brew "actionlint"
brew "shellcheck"
brew "shfmt"
brew "ssh-copy-id"

# Casks — Productivity
cask "1password"
cask "1password-cli"
cask "espanso"
cask "obsidian"
cask "spokenly"

# Casks — Browsers
cask "firefox@developer-edition"
cask "google-chrome"

# Casks — Dev tools
cask "ghostty"
cask "github"
cask "orbstack"
cask "visual-studio-code"
cask "zed"

# Casks — Database
cask "beekeeper-studio"
cask "postgres-app"
cask "tableplus"

# Casks — File transfer
cask "forklift"

# Casks — Design / measurement
cask "figma"
cask "pixelsnap"

# Casks — Communication
cask "discord"

# Casks — Network / Privacy
cask "nordvpn"

# Casks — Web dev utilities
cask "ngrok"

# Casks — Window management
cask "rectangle"

# Casks — System maintenance
cask "pearcleaner"
